CMS/TicketingLogs/RequestLog07-09-2022-04-33-30.txt

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <ImportTransIntegration xmlns="urn:microsoft-dynamics-schemas/codeunit/LS_Item_Price">
            <importWebSiteData>
                <Loyaltycustomer xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <customerEntryno></customerEntryno>
                    <customerNo></customerNo>
                    <customerContactno></customerContactno>
                    <customerMobileno></customerMobileno>
                    <customerLoyaltycustomer></customerLoyaltycustomer>
                    <customerClubcode></customerClubcode>
                    <customerSchemecode></customerSchemecode>
                    <customerName></customerName>
                    <customerName2></customerName2>
                    <customerAddress></customerAddress>
                    <customerAddress2></customerAddress2>
                    <customerCity></customerCity>
                    <customerCountry></customerCountry>
                    <customerPhoneno></customerPhoneno>
                    <customerEmail></customerEmail>
                    <customerPostcode></customerPostcode>
                </Loyaltycustomer>
                <TransactionHeader xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <headerReceiptNo>WR208902841758</headerReceiptNo>
                    <headerStoreNo>S1001</headerStoreNo>
                    <headerTansactionDate>2022-09-07</headerTansactionDate>
                    <headerTransactionTime>16:33:27</headerTransactionTime>
                    <headerOriginialDate>2022-09-07</headerOriginialDate>
                    <headerNoOfItem>1</headerNoOfItem>
                    <headerNoofItemLines></headerNoofItemLines>
                    <headerMembeCardNo></headerMembeCardNo>
                    <headerCustomerNo></headerCustomerNo>
                    <headerNetAmount>20</headerNetAmount>
                    <headerVATAmount></headerVATAmount>
                    <headerGrossAmount>22</headerGrossAmount>
                    <headerDiscountAmount>0</headerDiscountAmount>
                    <headerTenderType>Online Payment</headerTenderType>
                    <headerPaymentAmount>20</headerPaymentAmount>
					<headerNetPrice>20</headerNetPrice>
                    <TransactionLine>
	<lineReceiptNo>WR208902841758</lineReceiptNo>
	<lineTransDate>2022-09-07</lineTransDate>
	<lineTransTime>16:33:17</lineTransTime>
	<lineNo>10000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>6000679</lineTicketNo>
	<lineTicketExpiryDate>2022-09-07</lineTicketExpiryDate>
    <lineTicketActivateDate>2022-09-07</lineTicketActivateDate>
	<lineItemNo>1</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>11.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>20</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount></lineDiscountAmount>
	<lineAmount>20</lineAmount>
</TransactionLine><TransactionLine>
	<lineReceiptNo>WR208902841758</lineReceiptNo>
	<lineTransDate>2022-09-07</lineTransDate>
	<lineTransTime>16:33:25</lineTransTime>
	<lineNo>20000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>6000680</lineTicketNo>
	<lineTicketExpiryDate>2022-09-07</lineTicketExpiryDate>
    <lineTicketActivateDate>2022-09-07</lineTicketActivateDate>
	<lineItemNo>1</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>11.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>20</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount></lineDiscountAmount>
	<lineAmount>20</lineAmount>
</TransactionLine>
                </TransactionHeader>
            </importWebSiteData>
        </ImportTransIntegration>
    </Body>
</Envelope>
